List mockList = [
  {
    "company": "Google",
    "des": "谷歌公司（Google Inc.）成立于1998年9月4日，由拉里·佩奇和谢尔盖·布林共同创建，被公认为全球最大的搜索引擎公司。",
    "url": "https://i.52112.com/icon/jpg/256/20200424/75784/3196339.jpg"
  },
  {
    "company": "Microsoft",
    "des":
        "微软 [1]  （英文名称：Microsoft；中文名称：微软公司或美国微软公司）始建于1975年，是一家美国跨国科技公司，也是世界PC（Personal Computer，个人计算机）软件开发的先导，由比尔·盖茨与保罗·艾伦创办于1975年，公司总部设立在华盛顿州的雷德蒙德（Redmond，邻近西雅图）。以研发、制造、授权和提供广泛的电脑软件服务业务为主。",
    "url": "https://i.52112.com/icon/jpg/256/20191030/65165/2832951.jpg"
  },
  {
    "company": "Baidu",
    "des":
        "百度（纳斯达克：BIDU）是全球最大的中文搜索引擎，中国最大的以信息和知识为核心的互联网综合服务公司，全球领先的人工智能平台型公司。百度愿景是：成为最懂用户，并能帮助人们成长的全球顶级高科技公司。",
    "url": "https://i.52112.com/icon/jpg/256/20200102/70634/3016449.jpg"
  },
  {
    "company": "京东",
    "des":
        "京东JD.COM-专业的综合网上购物商城，销售超数万品牌、4020万种商品，囊括家电、手机、电脑、母婴、服装等13大品类。秉承客户为先的理念，京东所售商品为正品行货、全国联保、机打发票。",
    "url": "https://i.52112.com/icon/jpg/256/20190129/29229/1452036.jpg"
  },
  {
    "company": "阿里巴巴",
    "des": "阿里巴巴网络技术有限公司（简称：阿里巴巴集团或阿里巴巴）是以曾担任英语教师的马云为首的18人于1999年在浙江省杭州市创立的公司。",
    "url": "https://i.52112.com/icon/jpg/256/20190125/29054/1435880.jpg"
  }
];
